trade_exp/src/Documents/РегистрацияУдержаний/РегистрацияУдержаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="59b18004-526e-42f2-a879-72858780878a">
  <name>РегистрацияУдержаний</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="0cfc5d87-500b-47c4-bc59-53e1f62368fa">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fa3fbacb-3f1e-4fb7-b7ae-8ef80d773bf4">
    <name>Сотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d8516c59-315b-4b9f-aa93-7d7f7472f1fb">
    <name>Удержание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d4c2d274-c78b-4c31-a9ea-5ec768ec53e7">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4f78748e-a24a-4291-b85b-115ad1dd442e">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="12681a44-9b3b-44bc-af62-992f9b154aa4">
    <name>ДатаНачалаДействия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="07b16de5-ff78-4fce-8c6b-432442e61754">
    <name>ДатаОкончанияДействия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a877f0ad-1234-4b6a-8977-4819fbfd91e1">
    <name>Периодический</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="07024e26-fdc4-4544-a13a-48e5e48be1d8">
    <name>Закрыт</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d8042146-aa03-491f-a1b0-5bd276cbf8a9">
    <name>СуммаУдержания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0035154f-665a-437c-83af-0b5c47eccaf8">
    <name>Закрыл</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Document>

trade_exp/src/Documents/РегистрацияУдержаний/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.ДатаНачалаДействия) Тогда 
		Объект.ДатаНачалаДействия= ТекущаяДата();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Автор) Тогда 
		Объект.Автор= Пользователи.ТекущийПользователь();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПериодическийПриИзменении(Элемент)
	Элементы.ДатаОкончанияДействия.Доступность= Объект.Периодический;
	Элементы.Закрыт.Доступность= Объект.Периодический;
КонецПроцедуры


&НаСервере
Функция ЗначениеТекущийПользователь(ЕстьПользователь)
	Если ЕстьПользователь Тогда
		Возврат Пользователи.ТекущийПользователь();
	Иначе
		Возврат Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;
КонецФункции 

&НаКлиенте
Процедура ЗакрытПриИзменении(Элемент)
	Если Объект.Закрыт Тогда
		Если Не ЗначениеЗаполнено(Объект.ДатаОкончанияДействия) Тогда
			День = День(ТекущаяДата());
			Если День < 10 Тогда
				Объект.ДатаОкончанияДействия= КонецМесяца(ДобавитьМесяц(ТекущаяДата(), -1));
			Иначе
				Объект.ДатаОкончанияДействия= ТекущаяДата();
			КонецЕсли;
		КонецЕсли;
		
		Объект.Закрыл = ЗначениеТекущийПользователь(Истина);
	Иначе
		Объект.Закрыл = ЗначениеТекущийПользователь(Ложь);
	КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура УдержаниеПриИзменении(Элемент)
	Объект.СуммаУдержания= ЗначениеРеквизитаОбъекта(Объект.Удержание, "Тариф");
КонецПроцедуры

&НаСервере
Функция ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита);	
КонецФункции
